MJmj-kim/Monitoring/nRF5_SDK_15.3.0_59ac345/examples/ble_central/ble_app_uart_c/main.c
    while (strlen(src) <= length) {
	end = nrf_cal_get_time_calibrated();
	if ((end->tm_sec - start->tm_sec) >= time) return 0; 
    }
    if (strstr(src, pattern) == NULL) {
    return 0;
    }
    return 1;
}


void lte_check(void) {
    
    at_send("AT+QCDS\r", 9);
    checkMsg(temp_array, "\"SRV\"", 1, true, 1);
}


void lte_setup(void) {
     
  at_send("AT+QMTCONN?\r", 13); 
  if(!checkMsgMQTT(temp_array, "+QMTCONN: 0,3", 10, 1)) {
  
    at_send("AT+QMTCLOSE=0\r", 15);
    if(checkMsgMQTT(temp_array, "ERROR", 10, 4)||checkMsgMQTT(temp_array, "+QMTCLOSE: 0,0", 10, 30)) {

      at_send("AT+QMTCFG=\"SSL\",0,1,2\r",25);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QMTCFG=\"version\",0,4\r", 27);  
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"cacert\",2,\"root.pem\"\r",38);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"clientcert\",2,\"cert.pem\"\r", 42);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"clientkey\",2,\"key.pem\"\r", 40);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"seclevel\",2,2\r", 29);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"sslversion\",2,4\r", 31);
      checkMsg(temp_array, "OK", 10, false, 1);
 
      at_send("AT+QSSLCFG=\"ciphersuite\",2,0xffff\r", 37);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QSSLCFG=\"ignorelocaltime\",1\r", 34);
      checkMsg(temp_array, "OK", 10, false, 1);

      at_send("AT+QMTOPEN=0,\"avq1xsl5cm8b-ats.iot.us-west-2.amazonaws.com\",8883\r", 68);
      checkMsg(temp_array, "+QMTOPEN: 0,0", 10, false, 85);                    

      at_send("AT+QMTCONN=0,\"mqtttest\"\r", 27);
      checkMsg(temp_array, "+QMTCONN: 0,0,0", 10, false, 40);     
    }
  }
}


void sendlte(uint8_t * data)
{
    at_send("AT+QMTPUB=0,1,1,0,\"topic\"\r", 29);
    at_send(data, strlen(data));
    app_uart_put('\r');
    app_uart_put(0x1A);
    app_uart_put('\r');
    nrf_delay_ms(5000);

    return;
}



static void lte_timer_handler(void * p_context) {

  printf("%d, %d, %d\n", MASTER_MAP[0], MASTER_MAP[1], MASTER_MAP[2]);
  rptevt(MASTER_MAP);
  resetmap(MASTER_MAP);

}


static void create_timer(void) {

    ret_code_t err_code;
    err_code = app_timer_create(&m_lte_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                lte_timer_handler);
    APP_ERROR_CHECK(err_code);

}


static void start_lte_timer(void) {

    ret_code_t err_code;
    err_code = app_timer_start(m_lte_timer_id, APP_TIMER_TICKS(300000), NULL); //300000 (5min)
    APP_ERROR_CHECK(err_code);
       
}


void setmap(uint8_t (*map), int num) {

  map[num] = 1;

}
void clearmap(uint8_t (*map), int num) {

  map[num] = 0;

}
void resetmap(uint8_t (*map)) {
  for(int i = 0; i < BLE_EVT_COUNT; i++) {
    clearmap(map, i);
  }
}
int checkmap(uint8_t (*map), int event) {
  if(map[event]==0) {
    return 0;
  }
  else return 1;
}
void rptevt(uint8_t (*map)) {
  char msg[100];
  char* msg_current=msg;
  bool flag = false;


    for(int i=0;i<BLE_EVT_COUNT; i++) {
      if(checkmap(map, i)==0) {
        msg_current += sprintf(msg_current,"%d", 0);
      }
      else {
        msg_current += sprintf(msg_current,"%d", 1);
      } 
    }

    flag = true;

    if(flag) {
      
      //sendlte("I am not a robot");
      nrf_delay_ms(3000);
      sendlte(msg);
 
      return;
    
    }
}


void readBleHeo(uint8_t* msg) {
  
  int num = *msg - 48;

  setmap(MASTER_MAP,num);
  
  printf("%d, %d, %d\n", MASTER_MAP[0], MASTER_MAP[1], MASTER_MAP[2]);
  
  rptevt(MASTER_MAP);
  
  //printf("second  %d, %d, %d ", MASTER_MAP[0], MASTER_MAP[1], MASTER_MAP[2]);
  
}
///
/// Heo
///



/**@brief NUS UUID. */
static ble_uuid_t const m_nus_uuid =
{
    .uuid = BLE_UUID_NUS_SERVICE,
    .type = NUS_SERVICE_UUID_TYPE
};


/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for starting scanning. */
static void scan_start(void)
{
    ret_code_t ret;

    ret = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(ret);

    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}


/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;

    switch(p_scan_evt->scan_evt_id)
    {
         case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
         {
              err_code = p_scan_evt->params.connecting_err.err_code;
              APP_ERROR_CHECK(err_code);
         } break;

         case NRF_BLE_SCAN_EVT_CONNECTED:
         {
              ble_gap_evt_connected_t const * p_connected =
                               p_scan_evt->params.connected.p_connected;
             // Scan is automatically stopped by the connection.
             NRF_LOG_INFO("Connecting to target %02x%02x%02x%02x%02x%02x",
                      p_connected->peer_addr.addr[0],
                      p_connected->peer_addr.addr[1],
                      p_connected->peer_addr.addr[2],
                      p_connected->peer_addr.addr[3],
                      p_connected->peer_addr.addr[4],
                      p_connected->peer_addr.addr[5]
                      );
         } break;

         case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
         {
             NRF_LOG_INFO("Scan timed out.");
             scan_start();
         } break;

         default:
             break;
    }
}


/**@brief Function for initializing the scanning and setting the filters.
 */
static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

